Repository: kuma35/sed47doc-jp
Catalog: sed47doc-jp-level2.tmx
Source language: en_us
Languages: ja

source: #Multiline-techniques
ja: #Multiline-techniqu

source: $ seq 3 | sed ':x ; bx' # The above command requires gnu sed (which supports additional # commands following a label, without a newline).
ja: $ seq 3 | sed ':x ; bx' # 上記コマンド実行には gnu sed が必要です。 # （ラベル定義のあとで改行しないでいいのは gnu 拡張です。）

source: (Mnemonics) are shown in parentheses.
ja: (記憶法) 括弧内はコマンドの記憶法(mnemonic)です。

source: (Note that sed counts lines continuously across all input files unless -i or -s options are specified.)
ja: (注意：-i や -s コマンドラインオプションを指定しない限り、全ての入力ファイルを通して行番号を振ります）。

source: (This is particularly useful if the input is coming from the likes of ‘tail -f’, and you wish to see the transformed output as soon as possible.)
ja: (これは入力が ' tail -f 'のようなものから来ていて、変換された出力をできるだけ早く見たい場合に特に便利です)。

source: (filename) Print the file name of the current input file (with a trailing newline).
ja: (filename)現在の入力ファイル名を(末尾に改行を伴って)出力します(標準入力の場合は'-'を出力)）。

source: (hold) Replace the contents of the hold space with the contents of the pattern space.
ja: (hold)ホールドスペースの内容をパターンスペースの内容で置き換えます(cp pattern-space hold-space)。

source: (quit) Exit sed without processing any more commands or input.
ja: (quit)以降のコマンドや入力処理をせずにsedを終了させる。

source: (quit) This command is the same as q, but will not print the contents of pattern space.
ja: (quit)このコマンドはqコマンドと同じですが、パターンスペースの内容をプリントしません。

source: /software/gnulib/manual.css
ja: manual.css

source: 1 Introduction
ja: 1 はじめに

source: 2 Running sed
ja: 2 sedの実行

source: 3 sed scripts
ja: 3 sedスクリプト

source: 3.1 sed script overview
ja: 3.1 sedスクリプト概要

source: 4 Addresses: selecting lines
ja: 4 アドレス：行を選択する。

source: 4.3 selecting lines by text matching
ja: 4.3 テキストマッチによる対象行選択

source: 5 Regular Expressions: selecting text
ja: 5 正規表現: テキストの選択

source: 5.6 regular expression extensions
ja: 5.6 正規表現拡張

source: 6 Advanced sed: cycles and buffers
ja: 6 sedの高度な話題: サイクルとバッファ

source: 7 Some Sample Scripts
ja: 7 スクリプト例をいくつか

source: 8 GNU sed’s Limitations and Non-limitations
ja: 8 GNU sedの制限と、GNU sedで撤廃された制限

source: 9 Other Resources for Learning About sed
ja: 9 sedについて学べる、本やWebページなど

source: :eat $d Quit silently on the last line N Read another line, silently g Overwrite pattern space each time to save memory b eat
ja: :eat $d 最終行で何も出力せず終了 N 何も出力せずもう1行読み込む g 毎回ホールドスペースの内容(空っぽ)をパターンスペースに上書き b eat

source: A file name of ‘-’ refers to the standard input stream.
ja: ファイル名に ‘-’ を指定した場合は標準入力からの入力となります。

source: Most of the extensions accept sed programs that are outside the syntax mandated by POSIX, but some of them (such as the behavior of the N command described in Reporting Bugs) actually violate the standard.
ja: ほとんどの拡張機能はPOSIXで強制される文法外のsed プログラムを受け付けますが、それらのいくつかは(バグレポートで説明している'N'コマンドのような振る舞いは)実際には基準を破っています。

source: # (comment)
ja: # (コメント)

source: 30,35 is an address range.
ja: 30,35はアドレス範囲です。

source: e (command execution)
ja: e (シェルコマンド実行)

source: s///[we] (substitute with e or w flags)
ja: s///[we] (上記をeやwフラグで代用する)

source: sed commands follow this syntax:
ja: sedは構文は次の通り。

source: sed commands summary
ja: sedコマンド要約です。

source: sed does not support a typical if/then construct.
ja: sedには典型的なif/then構文がありません。

source: sed guru Greg Ubben wrote an implementation of the dc RPN calculator!
ja: sed導師のGreg UbbenはRPNのdcを実装しました！

source: sed is a stream editor.
ja: sedはストリームエディタです。

source: sed maintains two data buffers: the active pattern space, and the auxiliary hold space.
ja: sedは2つのバッファを保持しています。それは現に活動中のパターンスペースと補助のホールドスペースです。

source: sed may be invoked with the following command-line options:
ja: sedは以下のコマンドラインオプション達とともに起動することができます。

source: sed operates by performing the following cycle on each line of input: first, sed reads one line from the input stream, removes any trailing newline, and places it in the pattern space.
ja: sedは入力の各行ごとに以下のサイクルを実行します。最初にsedは入力ストリームから1行読み取り、末尾の改行を削除し、パターンスペースに入れます。

source: sed script overview
ja: sedスクリプト概要

source: sed scripts
ja: sed スクリプト

source: sed starts by reading the first line into the pattern space (i.e. ‘1’).
ja: sedは最初の1行をパターンスペースに読み込み（すなわちパターンスペースの内容は‘1’）

source: sed treats multiple input files as one long stream.
ja: sedは複数の入力ファイルを1つの長いストリームとして扱います。

source: sed writes output to standard output.
ja: 通常sedは標準出力に出力します。

source: sed’s inability to process invalid multibyte characters can be used to detect such invalid sequences in a file.
ja: sedが不正なマルチバイト文字を処理できないことを、ファイル内の不正なマルチバイト文字を含む文字列の検知に使うことができます。

source: sed’s regular expressions do not match invalid multibyte sequences in a multibyte locale.
ja: マルチバイトロケールでのsedの正規表現は不正なマルチバイト文字にマッチできません。

source: d is the delete command:
ja: dは削除コマンドです。

source: [addr] is an optional line address.
ja: [addr]は省略可能な行アドレスです。

source: /^foo/ is a regular-expression address.
ja: /^foo/は正規表現アドレスです。

source: q is the quit command.
ja: qはsed終了コマンドです。

source: 42 is the command option.
ja: 42はこのsedコマンドのオプションです。

source: [addr] can be a single line number, a regular expression, or a range of lines (see sed addresses).
ja: [addr]は行番号一つ、または正規表現、または行範囲を指定する事ができます(sedアドレス参照)。

source: appends line from the hold space to the pattern space, with a newline before it.
ja: パターンスペースの末尾に改行を追加し更にホールドスペースから1行パターンスペースに追加します。

source: appends line from the input file to the pattern space.
ja: 1行追加。入力ストリームから1行パターンスペースに追加する。

source: appends line from the pattern space to the hold space, with a newline before it.
ja: ホールドスペースの末尾に改行を追加し更にパターンスペースから1行追加します。

source: deletes line from the pattern space until the first newline, and restarts the cycle.
ja: パターンスペースから最初の改行まで(改行含む)1行を削除する。パターンスペースのプリントや全削除をスキップして次のサイクルを開始する。

source: prints line from the pattern space until the first newline.
ja: パターンスペースの最初の改行(改行含む)までの1行をプリントする。

source: POSIX mandates that such sequences are not matched by ‘.’, so that there is no portable way to clear sed’s buffers in the middle of the script in most multibyte locales (including UTF-8 locales).
ja: POSIXでは‘.’によって不正マルチバイト文字にマッチしない事を強制します。そのためほとんどのマルチバイトロケール（UTF-8ロケールを含む）ではsedのバッファをスクリプトの途中でクリアする移植性のある方法はありません。

source: X is a single-letter sed command.
ja: Xは(英語)1文字のsedコマンドです。

source: A sed program consists of one or more sed commands, passed in by one or more of the -e, -f, --expression, and --file options, or the first non-option argument if zero of these options are used.
ja: sedプログラムは1つ以上のsedコマンドで構成され、1つまたはそれ以上(混在もOK)の'-e'、'-f'、'--expression'、'--file'コマンドラインオプションで渡されるか、あるいはこれらのコマンドラインオプションが全く無いときはコマンドラインオプションで無い最初の引数がsedプログラムとして扱われます。

source: A common technique to process blocks of text such as paragraphs (instead of line-by-line) is using the following construct:
ja: （行ごとではなく）段落などのテキストブロックを処理するには以下のような構文を使用するのが一般的です。

source: A length of 0 (zero) means to never wrap long lines.
ja: 長さに 0 (ゼロ)を指定すると折り返ししなくなります。

source: A menu with all sed commands and command-line options.
ja: 全てのsedコマンドとコマンドラインオプション。

source: A menu with all the topics in this manual.
ja: このマニュアルの全てのトピックを含むメニュー。

source: A portable equivalent: # sed -e ':x' -e bx
ja: gnu sed 以外でも動くようにするには以下のようにします。 # sed -e ':x' -e bx

source: A portable, POSIX-compliant alternative is:
ja: 移植性のある、POSIX準拠の代替手段は次のとおりです。

source: A semicolon (‘;’) may be used to separate most simple commands:
ja: 一番簡単に複数のコマンドを区切る方法はセミコロン(‘;’)です。

source: A stream editor is used to perform basic text transformations on an input stream (a file or input from a pipeline).
ja: ストリームエディタは入力ストリーム（ファイルやパイプラインからの入力）に対して基本的なテキスト変換を実行します。

source: Actually, if sed prints a line without the terminating newline, it will nevertheless print the missing newline as soon as more text is sent to the same output stream, which gives the “least expected surprise” even though it does not make commands like ‘sed -n p’ exactly identical to cat.
ja: 実際には、sedが行末の改行無しの行をプリントするときでも、同じ出力ストリームに更にテキストが送られると、行末の改行なしの行に続いて改行をプリントしてから更なるテキストをプリントします。単に内容の通り出力するのではないわけで、sed -n pコマンドはcatコマンドと完全に同じ動作ではありません。

source: Add the commands contained in the file script-file to the set of commands to be run while processing the input.
ja: スクリプトファイルで指定されるファイルの内容を実行(予定の)コマンドに追加します。

source: Add the commands in script to the set of commands to be run while processing the input.
ja: 指定のスクリプトを実行(予定の)コマンドに追加します。

source: Additional [options] are used for some sed commands.
ja: 追加の[options]はいくつかのsedコマンドにあります。

source: Additionally, the commands q and Q can be used to terminate sed with a custom exit code value (this is a GNU sed extension):
ja: 加えてsedコマンド'q'や'Q'はsedを指定の終了コード値で終了させることが出来ます(これはGNU sed 拡張です)。

source: Addresses and regular expressions can be used as an if/then conditional: If [addr] matches the current pattern space, execute the command(s).
ja: アドレスや正規表現はif/then構文として使える。If パターンスペースの内容が[addr] に合致 then コマンド実行。

source: Addresses can be numeric, regular expressions, or a mix of both.
ja: アドレス範囲のアドレスは数字でも正規表現でも両方を混ぜる事もできます。

source: Addresses can contain regular expressions to match lines based on content instead of line numbers.
ja: アドレスは行番号の代わりに正規表現を含む事ができます。

source: Addresses determine on which line(s) the sed command will be executed.
ja: アドレスはsedコマンドを実行する対象行を決定します。

source: Addresses in a sed script can be in any of the following forms:
ja: sedスクリプトのアドレスは以下のいずれかの形式を取ります。

source: Addresses overview
ja: アドレス概要

source: Addresses: selecting lines
ja: アドレス：行を選択する

source: Advanced sed: cycles and buffers
ja: sedの高度な話題：サイクルとバッファ

source: All characters following a,c,i commands are taken as the text to append/change/insert.
ja: a、c、iコマンドの後にはappend/change/insertのためのテキストとして全ての文字を続ける事ができます。

source: All characters following ‘#’ until the next newline are ignored.
ja: ‘#’から次の改行までの全ての文字はsedから無視されます。

source: Alternatively, force the C locale to process each octet separately (every octet is a valid character in the C locale):
ja: あるいは、Cロケールにして1オクテット単位(1バイト単位で)処理させます（Cロケールでは全てのオクテット値(バイト値）が有効です）。

source: Alternatively, you may specify each command as an argument to an -e option:
ja: 代わりに各コマンドをそれぞれ-eオプションの引数として渡す事もできます。

source: An I/O error, or a serious processing error during runtime, GNU sed aborted immediately.
ja: I/Oエラーや実行中の深刻なエラー。GNU sedは即座にアボートします。

source: An address range is specified with two addresses separated by a comma (,).
ja: アドレス範囲を指定する時は2つのアドレスをカンマ(,)で区切ります。

source: An exit status of zero indicates success, and a nonzero value indicates failure.
ja: 0の終了ステータスは成功を表し、0以外の値は失敗を表します。

source: Any characters following the e command until the end of the line will be sent to the shell.
ja: eコマンドから改行までの全ての文字がシェルに送られます。

source: Any content left in the pattern space (the invalid characters) are added to the hold space using the H command.
ja: パターンスペースに残った任意の内容（不正なマルチバイト文字）は、Hコマンドによってホールドスペースに追加されます。

source: Append text after a line (alternative syntax).
ja: 行の後ろに text を追加する(代替構文)。

source: Append text after a line.
ja: 行のうしろに text を追加する。

source: Append a newline to the contents of the hold space, and then append the contents of the pattern space to that of the hold space.
ja: ホールドスペースの内容末尾に改行を追加し、更にパターンスペースの内容を追加します。

source: Append a newline to the contents of the pattern space, and then append the contents of the hold space to that of the pattern space.
ja: パターンスペースの内容末尾に改行を追加し、更にホールドスペースの内容を追加します。

source: Appending the ! character to the end of an address specification (before the command letter) negates the sense of the match.
ja: !文字をアドレス指定の終わり（コマンド文字の前) に指定するとマッチの否定になります。

source: As with the r command, the special value /dev/stdin is supported for the file name, which reads a line from the standard input.
ja: rコマンドに/dev/stdinをファイル名として与えた時は標準入力から読み込みます。

source: As with the r/R/w/W/e commands, these must be terminated with a newline.
ja: r/R/w/W/eコマンドは改行で終わっていなければなりません。

source: At the beginning of every cycle, the N command appends a newline and the next line to the pattern space (i.e. ‘1’, ‘\n’, ‘2’ in the first cycle).
ja: 毎度のサイクルを始めます。Nコマンドは(最初の1行をパターンスペースに読み込む時に取り除いた)改行を追加し、更に次の1行をパターンスペースに読み込みます( すなわちパターンスペースの内容は‘1’, ‘\n’, ‘2’ となる）。

source: At the next cycle the N command appends a newline and the next input line to the pattern space (e.g. ‘2’, ‘\n’, ‘3’).
ja: そのサイクルでNコマンドは同様に削除してあった改行追加し入力行をパターンスペースに追加します（すなわち、‘2’, ‘\n’, ‘3’).

source: Back-references and Subexpressions
ja: 後方参照とSubexpressions

source: Basic (BRE) and extended (ERE) regular expression
ja: 基本正規表現(basic regular expression;BRE)と拡張正規表現(extended regular expression;ERE)

source: Be cautious of using -n with -i: the former disables automatic printing of lines and the latter changes the file in-place without a backup.
ja: 警告：-n と -i を一緒に使用すると、前者は行の自動プリントを無効にし、そして、後者はバックアップ無しにファイルの内容を変更します。

source: Because -i takes an optional argument, it should not be followed by other short options:
ja: 注意：短いオプションである'-i'コマンドラインオプションは引数を取るので、これに他の短いコマンドラインオプション文字を続けて書いてはいけません。

source: Before reading the next input line, n prints the current pattern space then empties it, while N appends a newline and the next input line to the pattern space.
ja: nコマンドはパターンスペースの内容をプリントして、そしてパターンスペースの内容を全削除してから入力ストリームから次の1行を読み込みます。一方、 Nコマンドはひたすら改行と次の入力行をパターンスペースに追加していきます。

source: Both are initially empty.
ja: 両方とも最初は空です。

source: Both examples do not inf-loop, despite never starting a new cycle.
ja: 両例とも、決して新しいサイクルを始めることは無いにもかかわらず無限ループになりません。

source: Branch to label only if there have been no successful substitutions since the last input line was read or conditional branch was taken.
ja: sコマンドによる置換が失敗した後で、かつ最後の入力行が読み込まれてないか他の条件分岐が実行されてない場合(暗黙のsコマンド実行結果フラグがまだクリアされてない間)、指定のラベルへジャンプします。

source: Branch unconditionally to label.
ja: 指定の label へ無条件ジャンプ。

source: Branching and Cycles
ja: 分岐とサイクル

source: Branching and Flow Control
ja: 分岐と制御構文

source: Branching example: joining lines
ja: 分岐例: 行連結

source: Branching is often complemented with the n or N commands: both commands read the next input line into the pattern space without waiting for the cycle to restart.
ja: 分岐はしばしばnコマンドやNコマンドと一緒に使われます。両コマンドは次のサイクルを開始することなしに入力ストリームから1行入力行をパターンスペースに入れます。

source: Buffer both input and output as minimally as practical.
ja: 入出力でのバッファリングをできるかぎり少なくします

source: But it is sed’s ability to filter text in a pipeline which particularly distinguishes it from other types of editors.
ja: しかしsedがパイプラインでテキストをフィルタ処理できる点は、他のタイプのエディタとの明確な違いです。

source: By default sed prints all processed input (except input that has been modified/deleted by commands such as d).
ja: デフォルトではsedは( ' d'コマンド等によって変更・削除されない限り)、入力処理した全てをプリントします。

source: By default, sed prints out the pattern space at the end of each cycle through the script (see How sed works).
ja: デフォルトではsedはスクリプトを実行し、各サイクルが終わるとパターンスペースの内容をプリントします(sedはどのように動くか をご覧ください)。

source: By default, sed reads an input line into the pattern buffer, then continues to processes all commands in order.
ja: デフォルトではsedは入力行をパターンスペースに読み込み、それから全てのコマンドを順番に実行します。

source: By default, sed will consider the files specified on the command line as a single continuous long stream.
ja: デフォルトではsedはコマンドラインで指定されたファイル群を1つの長いストリームとして扱います。

source: Centering Lines
ja: センタリング

source: Character Classes and Bracket Expressions
ja: キャラクタクラスとブラケット表現

source: Combined with an address, the branch can be conditionally executed on matched lines.
ja: 分岐はアドレスと組み合わせると、条件に適合した時だけジャンプさせることができます。

source: Command and Option Index
ja: sedコマンドとそのオプションの索引

source: Command-Line Options
ja: コマンドラインオプション

source: Commands Requiring a newline
ja: sedコマンドに改行が必要な時

source: Commands Specific to GNU sed
ja: GNU sed 固有のコマンド

source: Commands for sed gurus
ja: sed導師のためのコマンド群

source: Commands specific of GNU sed
ja: GNU sed固有のコマンド達

source: Commands with addresses affect only matching lines.
ja: アドレス指定のあるコマンドはアドレス指定に合致する行に対してだけ実行されます。

source: Commands within a script or script-file can be separated by semicolons (;) or newlines (ASCII 10).
ja: スクリプト内やスクリプトファイル内のコマンド達はセミコロン(;)や改行(ASCII \x0a)で区切る事ができます。

source: Commands without addresses affect all lines.
ja: アドレス指定の無いコマンドは全ての行で実行されます。

source: Concept Index
ja: 概念索引

source: Consider the following two examples:
ja: ここで以下の2つの例について考えてみます。

source: Copying and sharing this manual
ja: このマニュアルのコピーと共有について

source: Counting Characters
ja: 文字数を数える

source: Counting Lines
ja: 行数を数える

source: Counting Words
ja: 単語数を数える

source: Delete the pattern space; immediately start next cycle.
ja: パターンスペースの内容を全削除し、以降のコマンドの実行をスキップして直ちに次のサイクルを開始する。

source: Details and examples for each command are in the following sections.
ja: 各コマンドの詳細と例は次の節をご覧ください。

source: Details of sed scripts and individual sed commands are discussed in the next chapter.
ja: sedスクリプトの詳細や、独特なsedコマンド達については次章で取り扱います。

source: Escape Sequences - specifying special characters
ja: エスケープシーケンス - 特殊文字の指定

source: Escaping Precedence
ja: エスケープ文字の打ち消し

source: Everything said under the w command about file handling holds here too.
ja: w コマンドでファイル処理について述べられていることはこのコマンドにも全て当てはまります。

source: Executes command and sends its output to the output stream.
ja: シェルコマンドcommandを実行し、その出力を出力ストリームへ送ります。

source: Executes the command that is found in pattern space and replaces the pattern space with the output; a trailing newline is suppressed.
ja: パターンスペース内に見つけたシェルコマンドを実行し、パターンスペースの内容をそのシェルコマンドの出力で置き換えます(末尾の改行は抑制されます)。

source: Exit status
ja: 終了ステータス

source: Extended regexps are those that egrep accepts; they can be clearer because they usually have fewer backslashes.
ja: 拡張正規表現とはegrepが受け付けるものです。バックスラッシュの嵐を減らせるので正規表現がより分かりやすくなります。

source: Extension for easier scripting
ja: スクリプトを書きやすくする拡張です。

source: For example, to replace all occurrences of ‘hello’ to ‘world’ in the file input.txt:
ja: 例えばinput.txtファイル内にある全ての‘hello’ を‘world’ に置き換えるには次のようにします。

source: For example: The command /^#/d means: if the current pattern matches the regular expression ^# (a line starting with a hash), then execute the d command: delete the line without printing it, and restart the program cycle immediately.
ja: 例：/^#/d は、if パターンスペースが正規表現^#（行頭が#）に合致する then d コマンド実行（当該行を削除し、プリントせず、次のサイクルを開始する）。

source: For more annotated examples, see Text search across multiple lines and Line length adjustment.
ja: 注釈付きの例については、複数行にわたるテキスト検索や行の長さを揃えるを参照下さい。

source: For more information about branching and labels see Branching and flow control.
ja: 分岐とラベルについて更に詳しくは分岐と制御構文をご覧ください。

source: GNU sed does this by creating a temporary file and sending output to this file rather than to the standard output.1.
ja: そのために、GNU sed はテンポラリファイルを作り、標準出力ではなくこのテンポラリファイルに出力します。

source: GNU sed includes several extensions to POSIX sed.
ja: GNU sedはPOSIX sedに数々の拡張を加えています。

source: GNU sed offers the special z command to clear the current pattern space regardless of invalid multibyte characters (i.e. it works like s/.*// but also removes invalid multibyte characters):
ja: GNU sedには不正なマルチバイト文字に関係なくパターンスペースの内容を全削除する特別なコマンドzコマンドがあります（s/.*//のように動作しますが、無効なマルチバイト文字も削除します。

source: GNU sed processes valid multibyte characters in multibyte locales (e.g. UTF-8).
ja: GNU sedはマルチバイトロケール（例 UTF-8）でマルチバイト文字を適切に処理できます。

source: GNU sed returns the following exit status error values:
ja: GNU sedは以下の終了ステータス値を返します。

source: GNU sed has accepted -E as an undocumented option for years, and *BSD seds have accepted -E for years as well, but scripts that use -E might not port to other older systems.
ja: GNU sedは何年も前から文書化されていないオプションとして -E を受け入れていますし、*BSD sedsは何年もの間' -E 'を受け入れていますが、' -E 'を使うスクリプトは他の古いシステムに移植できないかもしれません。

source: Historically this was a GNU extension, but the -E extension has since been added to the POSIX standard (http://austingroupbugs.net/view.php?id=528), so use -E for portability.
ja: これは歴史的にはGNU拡張でしたが '-E'拡張はPOSIX標準に取り込まれた(http://austingroupbugs.net/view.php?id=528)ので、移植性の為に'-E'を使います。

source: Hold and Pattern Buffers
ja: ホールドとパターン用のバッファ

source: How sed Works
ja: sedはどのように動いているか

source: How sed works
ja: sedはどのように動いているか

source: If [addr] is specified, the command X will be executed only on the matched lines.
ja: [addr]が指定されると、sedコマンド X はそのアドレスにマッチした行でのみ実行されます。

source: If -e or -f options are used to specify a script, all non-option parameters are taken as input files.
ja: '-e'や'-f'コマンドラインオプションがスクリプト指定の為に使われると、全てのコマンドオプションでないコマンドラインパラメータが入力ファイル群として使われます。

source: If a parameter is specified, instead, the e command interprets it as a command and sends its output to the output stream.
ja: 代わりに、パラメータを指定してeコマンドを実行すると、コマンドはパラメータをシェルコマンドとして解釈して実行し、そのシェルコマンドの実行結果出力ストリームに送ります。

source: If any command-line parameters remain after processing the above, these parameters are interpreted as the names of input files to be processed.
ja: 上記の処理後にコマンドラインパラメータが残っている場合、これらのパラメータは処理対象の入力ファイルの名前として解釈されます。

source: If no -e, -f, --expression, or --file options are given on the command-line, then the first non-option argument on the command line is taken to be the script to be executed.
ja: コマンドラインに -e や -f や --expression や --file オプションが指定されていない場合は、コマンドラインの最初のオプションではない引数が、実行されるスクリプトになります。

source: If no addresses are given, the command is performed on all lines.
ja: アドレスが与えられてない時はコマンドは全ての行に対して実行されます。

source: If no extension is supplied, the original file is overwritten without making a backup.
ja: 拡張子が与えられない時はバックアップを作ること無しに入力ファイルは上書きされます。

source: If not specified, it is taken to be 70.
ja: 指定が無い場合は70です。

source: If pattern space contains newlines, delete text in the pattern space up to the first newline, and restart cycle with the resultant pattern space, without reading a new line of input.
ja: パターンスペースが改行を含んでいれば、パターンスペースの最初の改行までを削除し、次の入力行を読み込まずに、削除後のままのパターンスペースに対して次のサイクルを開始します。

source: If pattern space contains no newline, start a normal new cycle as if the d command was issued.
ja: パターンスペースが改行を含んでいない場合はdコマンドと同じ動作で、次の入力行を読み込み次のサイクルを開始します。

source: If such line is found, sed will terminate with exit status 42.
ja: その次の例は行頭に‘foo’がある行を見つけるとsed自身を終了させ、終了ステータス 42を返します。

source: If such line was not found (and no other error occurred), sed will exit with status 0.
ja: 行頭に‘foo’がある行が見つからなかった時(そして他のエラーが発生しなかった時)はsed終了時に終了ステータス 0 を返します。

source: If the label is omitted the branch commands restart the cycle.
ja: なお、ブランチコマンドでラベルを省略すると次のサイクルを開始します。

source: If whitespace, comments or semicolons are found, they will be included in the filename, leading to unexpected results:
ja: 空白やコメントやセミコロンがある場合もファイル名の一部と解釈されるので、その場合は予期しない結果につながります。

source: If whitespace, comments or semicolons are found, they will be included in the shell command or filename, leading to unexpected results:
ja: 空白やコメントやセミコロンがある場合もファイル名やシェルコマンドの一部と解釈されるので、その場合は予期しない結果につながります。

source: If whitespace, comments or semicolons are found, they will be included in the shell command, leading to unexpected results:
ja: 空白やコメントやセミコロンがある場合もシェルコマンドに含まれるので、その場合は予期しない結果につながります。

source: If you do not specify INPUTFILE, or if INPUTFILE is -, sed filters the contents of the standard input.
ja: INPUTFILE(入力ファイル)が指定されないか、または, '-'と指定されたときはsedは標準入力より入力します。

source: If you want to disable only the latter kind of extension, you can set the POSIXLY_CORRECT variable to a non-empty value.
ja: GNU 拡張を無効にしたい場合は環境変数 POSIXLY_CORRECT に空で無い値をセットして下さい。

source: In a UTF-8 locale, sed correctly processes the Sigma as one character despite it being 2 octets (bytes):
ja: UTF-8ロケールではsedは2オクテット(2バイト)であってもシグマを正しく1文字として処理します。

source: In a substitution command, the w flag writes the substitution result to a file, and the e flag executes the subsitution result as a shell command.
ja: wフラグはs///コマンド実行結果をファイルに書き込み、eフラグはs///コマンド実行結果をシェルコマンドとして実行します。

source: In addition, you can specify the version of sed that your script requires, such as 4.0.5.
ja: 加えて、実行に必要なsed のバージョンを 4.0.5 のように指定することができます（訳注：実行するsedが指定バージョンより低い場合はエラー'sed の新版が前提です'になります）。

source: In both cases, the results are undefined if the command to be executed contains a NUL character.
ja: どちらの場合も、実行されるコマンドに\x00(ASCII NUL)バイトが含まれているとその結果は不明(未定義)です。

source: In order to simplify writing portable scripts, this option disables all the extensions that this manual documents, including additional commands.
ja: 移植性のあるスクリプトの作成を簡単にする為に、このオプションはGNU sedで追加されたコマンド含めこの文書に述べられている全てのGNU sed拡張を無効にします。
